#### BuiltInFailures.AutoRouteFailures Members

---

|  |
| --- |
| BuiltInFailures AutoRouteFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures AutoRouteFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | AttemptToConnectNonSlopingElementToSlopedPipeError | You have specified that sloped pipe be drawn, but are trying to connect to an element that doesn't support sloping connections. |
| Public property Static member | AttemptToConnectNonSlopingElementToSlopedPipeWarning | You have specified that sloped pipe be drawn, but are trying to connect to an element that doesn't support sloping connections. |
| Public property Static member | DesignOptionConflictError | The solution is failing to do the elements are not in the same Design Option. |
| Public property Static member | DesignOptionConflictWarning | The solution is failing to do the elements are not in the same Design Option. |
| Public property Static member | DistributionTypeInvalid | Selected distribution system type is invalid! |
| Public property Static member | ElementHasFlowCalculation | This element has an open connection. This may not be an error, but for flow calculations to work correctly all connections should be sealed with an end cap. |
| Public property Static member | ElementHasOpenConnection | This element has an open connection. This may not be an error, but all open connections should be sealed with an end cap. |
| Public property Static member | FailedDowngradeCrossToElbow | Failed to downgrade tee type to elbow type. |
| Public property Static member | FailedDowngradeCrossToTee | Failed to downgrade cross type to tee type. |
| Public property Static member | FailedDowngradeTeeToCross | Failed to upgrade tee type to cross type. |
| Public property Static member | FailToDoCompatiblePhaseError | The solution is failing to do the elements Phases are compatible. |
| Public property Static member | FailToDoCompatiblePhaseWarning | The solution is failing to do the elements Phases are compatible. |
| Public property Static member | FailToIntersectParallelSegmentsError | The solution is failing to do segments which are parallel and should intersect. |
| Public property Static member | FailToIntersectParallelSegmentsWarning | The solution is failing to do segments which are parallel and should intersect. |
| Public property Static member | FittingParamsCauseGeometryToFailError | The one of parameters for the fitting is causing the geometry to fail. |
| Public property Static member | FittingParamsCauseGeometryToFailWarning | The one of parameters for the fitting is causing the geometry to fail. |
| Public property Static member | HighlightedElementDisconnected | The highlighted element has been disconnected. |
| Public property Static member | InappropriateSlopeForPipe | The slope that you specified could not be applied to this pipe. Please check the items that it is connected to and make sure that they aren't constraining the slope of them. |
| Public property Static member | MismatchedSystemClassificationHasSystemWarning | The selected fixture is part of a system with different classification. System calculations (e.g. flow analysis) are not possible between systems with different classifications. |
| Public property Static member | MismatchedSystemClassificationNoSystemWarning | The selected fixture is assigned to a system with different classification. |
| Public property Static member | MismatchedSystemTypeWarning | The selected fixture is part of a different system. You may want to edit the system type and merge two systems. |
| Public property Static member | NoAutoRouteSolutionFoundError | No auto-route solution was found. |
| Public property Static member | NoAutoRouteSolutionFoundWarning | No auto-route solution was found. |
| Public property Static member | NoFittingInProjectError | The routing solution failed because there is no default fitting type specified or the fitting cannot be found in the project. Ensure the fitting is loaded in the project and try again. |
| Public property Static member | NoFittingInProjectWarning | The routing solution failed because there is no default fitting type specified or the fitting cannot be found in the project. Ensure the fitting is loaded in the project and try again. |
| Public property Static member | NoFittingInRoutingError | The fitting that is converted to was not defined. Please assign one in the routing preference. |
| Public property Static member | NoFittingLoadedInProjectError | The fitting that is converted to was not defined. Please load one fitting family and assign it in the routing preference. |
| Public property Static member | NoSolutionInView | There is no solution for this view. All the elements have been filtered for this view, select another view, and select solutions. |
| Public property Static member | NotAllPartsWereConvertedCannotAddPlaceholderWarning | Not all parts were converted. Placeholders could not be added to fill the gap (the gap was too small). Check the fabrication service definition for the system. |
| Public property Static member | NotAllPartsWereConvertedPlaceholdersWereAddedWarning | Not all parts were converted. Placeholders were added to fill the gaps. Check the fabrication service definition for the system. |
| Public property Static member | NotEnoughRoomForFittingsError | There was not enough room to place the required fittings. Consider increasing the length of the segments, or moving them farther apart to generate a solution. |
| Public property Static member | NotEnoughRoomForFittingsWarning | There was not enough room to place the required fittings. Consider increasing the length of the segments, or moving them farther apart to generate a solution. |
| Public property Static member | NoValidSolutionAtSelectedPoint | No valid auto-route solution at selected point. |
| Public property Static member | OverrideFabricationPartFailed | The fabrication part cannot be overridden. The button code you specified does not match the fabrication service. Please specify a different button code or check the fabrication service and try again. |
| Public property Static member | SegmentDrawnFromWrongSideError | The segment is being drawn from the wrong side to connect to the location you indicated. |
| Public property Static member | SegmentDrawnFromWrongSideWarning | The segment is being drawn from the wrong side to connect to the location you indicated. |
| Public property Static member | SegmentsAngleTooGreatError | The resulting angle between the segments is too great. |
| Public property Static member | SegmentsAngleTooGreatWarning | The resulting angle between the segments is too great. |
| Public property Static member | SolutionIsOppositeToConnectionError | The solution is in the opposite direction of the connection direction. |
| Public property Static member | SolutionIsOppositeToConnectionWarning | The solution is in the opposite direction of the connection direction. |
| Public property Static member | SpecifiedAnglesNotCompatibleWithLayoutError | The specified angles are not compatible with current layout. |
| Public property Static member | SpecifiedAnglesNotCompatibleWithLayoutWarning | The specified angles are not compatible with current layout. |
| Public property Static member | UnableToMakeConnectionInDirection | The application is unable to make a connection in that direction. If the connectors are pointing up, make sure that the elevations of the segments (ducts and pipes) are above them. If the connectors are pointing down, make sure that the elevations of the segments (ducts and pipes) are below them. |
| Public property Static member | UtilizationCoefficientOutOfRange | The value for Coefficient of Utilization must be between 0 and 1. |
| Public property Static member | ZeroLengthSegmentError | The solution is failing to do segments which are zero length. |
| Public property Static member | ZeroLengthSegmentWarning | The solution is failing to do segments which are zero length. |

# See Also

BuiltInFailures AutoRouteFailures Class

Autodesk.Revit.DB Namespace